Tekla Open API Reference for Tekla Structures 2025
TaskWorktype Properties
The TaskWorktype type exposes the following members.
Properties
Name | Description
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Name
 The name of the task worktype.
Top
See Also
Reference
TaskWorktype Class
Tekla.Structures.Model Namespace